(function() {
    var urlBase = "/new/views/secukit-html5/v2.0.0.0";

    /* 환경 변수 설정 시작 */
    window.webnpki_config = {
        /* 언어 설정  (KO, EN, FR) */
        language: 'ko',

        version: "2.0.0.0",

        /* alert 단계 설정 (0: 없음, 1: 에러만, 2: 결과 포함, 3: 전체 과정 포함*/
        alert: 3,

        /* Logger 단계 설정 (0: 없음, 1: 에러만 2: 결과 포함, 3: 전체 과정 포함 */
        logger: 3,

        /* home directory */
        path: urlBase + '/secukit-html5/',
        /* core directory */
        core: urlBase + '/secukit-html5/core/wn/',
        /* UI directory */
        ui: urlBase + '/secukit-html5/dialog/',
        
        /* Relay Server Address */
        webRelay: "http://192.168.110.181:8443/web-relay/cert",
        
        /* Default charset */
        charset: "utf8",
        
        /* Policy 추가 설정. (내부 테이블보다 우선) */
        certPolicyTable: {
            // 한국정보인증
            '1.2.410.200004.5.2.1.1': '법인(범용)',
            '1.2.410.200004.5.2.1.2': '개인(범용)',
            '1.2.410.200004.5.2.1.7.1': '은행거래용/보험용',
            '1.2.410.200004.5.2.1.7.2': '증권거래용/보험용',
            '1.2.410.200004.5.2.1.7.3': '신용카드용',

            //한국 증권 전산
            '1.2.410.200004.5.1.1.7': '법인 범용',
            '1.2.410.200004.5.1.1.5': '개인 범용',
            '1.2.410.200004.5.1.1.9': '용도제한용',

            // 금융결재원
            '1.2.410.200005.1.1.5': '법인 범용',
            '1.2.410.200005.1.1.1': '개인 범용',
            '1.2.410.200005.1.1.4': '은행/보험용',
            '1.2.410.200005.1.1.6.2': '신용카드용',

            //한국전자인증
            '1.2.410.200004.5.4.1.2': '법인 범용',
            '1.2.410.200004.5.4.1.1': '개인 범용',
            '1.2.410.200004.5.4.1.101': '인터넷뱅킹용',
            '1.2.410.200004.5.4.1.102': '증권거래용',
            '1.2.410.200004.5.4.1.103': '인터넷보험용',
            '1.2.410.200004.5.4.1.104': '신용카드용',
            '1.2.410.200004.5.4.1.105': '전자민원용',
            '1.2.410.200004.5.4.1.106': '인터넷뱅킹용/전자민원용',
            '1.2.410.200004.5.4.1.107': '증권거래용/전자민원용',
            '1.2.410.200004.5.4.1.108': '인터넷보험용/전자민원용',
            '1.2.410.200004.5.4.1.109': '신용카드용/전자민원용',

            //한국무역통신
            '1.2.410.200012.1.1.3': '법인 범용',
            '1.2.410.200012.11.31': '은행거래용(서명용)',
            '1.2.410.200012.11.32': '은행거래용(암호용)',
            '1.2.410.200012.11.35': '증권거래용(서명용)',
            '1.2.410.200012.11.36': '증권거래용(암호용)',
            '1.2.410.200012.11.39': '보험거래용(서명용)',
            '1.2.410.200012.11.40': '보험거래용(암호용)',
            '1.2.410.200012.11.43': '신용카드용(서명용)',
            '1.2.410.200012.11.44': '신용카드용(암호용)'
        },

         /* Set the representation (right-side) of issueres, the issuer ID (left-side) is lower case only.  */
        issuers: {
            "kica": "한국정보인증",
            "crosscert": "Crosscert",
            "yessign": "Yessign",
            "signkorea": "Signkorea",
            "tradesign": "Tradesign",
            "ncasign": "Ncasign",
            "inipass": "INIPASS",
            "kisa": "KISA"
        },

        dnFilter: "",

        /**
         * 인증서 허용 Policy 목록.
         * 삭제 혹은 빈 배열 설정시 전체 인증서 허용.
         * ex) ["1.2.410.200004.5.2.1.1", "1.2.410.200004.5.2.1.2", ......]
         */
        allowedPolicyOIDs: [],

        /* SignCert.der 및 SignPri.key 를 웹 저장소에 저장할 때, 비밀번호를 물어볼지에 대한 옵션 */
        askPwd: false,

        /* webnpki 모듈의 라이센스 2020-04-22 09:20:31	  */
        license: 'b6a7b066b631b152b025b950b524b859b465b212b595b041b504bb5cb425b049b594b95fb066be74b627c00f',

        /* keyboard security
         * 빈 문자열 설정 시, 키보드 보안 미적용
         * 키보드보안 적용 시 해당되는 자바스크립트 추가 필요
         */
        keyboardSecurity: 'default'
        
    };
    /* 환경 변수 설정 종료 */
})();